app/controllers/abouts_controller.rb

  def index
    @abouts = About.all
---
SELECT "abouts".* FROM "abouts"

  def create
    @about = About.new(about_params)

    respond_to do |format|
      if @about.save
---
INSERT INTO "abouts" ("title", "description", "order", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def update
    respond_to do |format|
      if @about.update(about_params)
---
UPDATE "abouts" SET "description" = $1, "updated_at" = $2 WHERE "abouts"."id" = $3  [["description", "Read more about my endevours on my blog, <a href=\"#\">right here.</a>"], ["updated_at", "2015-10-26 21:03:38.934360"], ["id", 5]]

    def set_about
      @about = About.find(params[:id])
---
SELECT  "abouts".* FROM "abouts" WHERE "abouts"."id" = $1 LIMIT 1  [["id", 5]]