app/controllers/hero_phrases_controller.rb

  def index
    @hero_phrases = HeroPhrase.all
---
SELECT "hero_phrases".* FROM "hero_phrases"

  def create
    @hero_phrase = HeroPhrase.new(hero_phrase_params)

    respond_to do |format|
      if @hero_phrase.save
---
INSERT INTO "hero_phrases" ("text", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["text", "RAILS DEVELOPER"], ["created_at", "2015-11-02 17:43:02.836927"], ["updated_at", "2015-11-02 17:43:02.836927"]]

  def update
    respond_to do |format|
      if @hero_phrase.update(hero_phrase_params)
---
UPDATE "hero_phrases" SET "text" = $1, "updated_at" = $2 WHERE "hero_phrases"."id" = $3  [["text", "WORDPRESS DEVELOPER"], ["updated_at", "2015-11-02 17:45:15.874910"], ["id", 12]]

    def set_hero_phrase
      @hero_phrase = HeroPhrase.find(params[:id])
---
SELECT  "hero_phrases".* FROM "hero_phrases" WHERE "hero_phrases"."id" = $1 LIMIT 1  [["id", 12]]