app/controllers/pages_controller.rb

SELECT "abouts".* FROM "abouts"  ORDER BY "abouts"."order" ASC
SELECT "hero_phrases"."text" FROM "hero_phrases"
---
  def home
    @about_items = About.order(:order)

    #This will not load all the attributes. Will bring only the text attribute in an array.
    @phrases = HeroPhrase.pluck(:text)